Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/tram.h
/** \brief TRAM register offsets definitions */
#define TRAM_CTRLA_REG_OFST            _UINT32_(0x00)      /* (TRAM_CTRLA) Control Offset */
#define TRAM_INTENCLR_REG_OFST         _UINT32_(0x04)      /* (TRAM_INTENCLR) Interrupt Enable Clear Offset */
#define TRAM_INTENSET_REG_OFST         _UINT32_(0x08)      /* (TRAM_INTENSET) Interrupt Enable Set Offset */
#define TRAM_INTFLAG_REG_OFST          _UINT32_(0x0C)      /* (TRAM_INTFLAG) Interrupt Flag Status and Clear Offset */
#define TRAM_STATUS_REG_OFST           _UINT32_(0x10)      /* (TRAM_STATUS) Status Offset */
#define TRAM_SYNCBUSY_REG_OFST         _UINT32_(0x14)      /* (TRAM_SYNCBUSY) Synchronization Busy Status Offset */
#define TRAM_DSCC_REG_OFST             _UINT32_(0x18)      /* (TRAM_DSCC) Data Scramble Control Offset */
#define TRAM_PERMW_REG_OFST            _UINT32_(0x1C)      /* (TRAM_PERMW) Permutation Write Offset */
#define TRAM_PERMR_REG_OFST            _UINT32_(0x20)      /* (TRAM_PERMR) Permutation Read Offset */
#define TRAM_RAM_REG_OFST              _UINT32_(0x1000)    /* (TRAM_RAM) TrustRAM Offset */
#define TRAM_RAM0_REG_OFST             _UINT32_(0x1000)    /* (TRAM_RAM0) TrustRAM Offset */
#define TRAM_RAM1_REG_OFST             _UINT32_(0x1004)    /* (TRAM_RAM1) TrustRAM Offset */
#define TRAM_RAM2_REG_OFST             _UINT32_(0x1008)    /* (TRAM_RAM2) TrustRAM Offset */
#define TRAM_RAM3_REG_OFST             _UINT32_(0x100C)    /* (TRAM_RAM3) TrustRAM Offset */
#define TRAM_RAM4_REG_OFST             _UINT32_(0x1010)    /* (TRAM_RAM4) TrustRAM Offset */
#define TRAM_RAM5_REG_OFST             _UINT32_(0x1014)    /* (TRAM_RAM5) TrustRAM Offset */
#define TRAM_RAM6_REG_OFST             _UINT32_(0x1018)    /* (TRAM_RAM6) TrustRAM Offset */
#define TRAM_RAM7_REG_OFST             _UINT32_(0x101C)    /* (TRAM_RAM7) TrustRAM Offset */
#define TRAM_RAM8_REG_OFST             _UINT32_(0x1020)    /* (TRAM_RAM8) TrustRAM Offset */
#define TRAM_RAM9_REG_OFST             _UINT32_(0x1024)    /* (TRAM_RAM9) TrustRAM Offset */
#define TRAM_RAM10_REG_OFST            _UINT32_(0x1028)    /* (TRAM_RAM10) TrustRAM Offset */
#define TRAM_RAM11_REG_OFST            _UINT32_(0x102C)    /* (TRAM_RAM11) TrustRAM Offset */
#define TRAM_RAM12_REG_OFST            _UINT32_(0x1030)    /* (TRAM_RAM12) TrustRAM Offset */
#define TRAM_RAM13_REG_OFST            _UINT32_(0x1034)    /* (TRAM_RAM13) TrustRAM Offset */
#define TRAM_RAM14_REG_OFST            _UINT32_(0x1038)    /* (TRAM_RAM14) TrustRAM Offset */
#define TRAM_RAM15_REG_OFST            _UINT32_(0x103C)    /* (TRAM_RAM15) TrustRAM Offset */
#define TRAM_RAM16_REG_OFST            _UINT32_(0x1040)    /* (TRAM_RAM16) TrustRAM Offset */
#define TRAM_RAM17_REG_OFST            _UINT32_(0x1044)    /* (TRAM_RAM17) TrustRAM Offset */
#define TRAM_RAM18_REG_OFST            _UINT32_(0x1048)    /* (TRAM_RAM18) TrustRAM Offset */
#define TRAM_RAM19_REG_OFST            _UINT32_(0x104C)    /* (TRAM_RAM19) TrustRAM Offset */
#define TRAM_RAM20_REG_OFST            _UINT32_(0x1050)    /* (TRAM_RAM20) TrustRAM Offset */
#define TRAM_RAM21_REG_OFST            _UINT32_(0x1054)    /* (TRAM_RAM21) TrustRAM Offset */
#define TRAM_RAM22_REG_OFST            _UINT32_(0x1058)    /* (TRAM_RAM22) TrustRAM Offset */
#define TRAM_RAM23_REG_OFST            _UINT32_(0x105C)    /* (TRAM_RAM23) TrustRAM Offset */
#define TRAM_RAM24_REG_OFST            _UINT32_(0x1060)    /* (TRAM_RAM24) TrustRAM Offset */
#define TRAM_RAM25_REG_OFST            _UINT32_(0x1064)    /* (TRAM_RAM25) TrustRAM Offset */
#define TRAM_RAM26_REG_OFST            _UINT32_(0x1068)    /* (TRAM_RAM26) TrustRAM Offset */
#define TRAM_RAM27_REG_OFST            _UINT32_(0x106C)    /* (TRAM_RAM27) TrustRAM Offset */
#define TRAM_RAM28_REG_OFST            _UINT32_(0x1070)    /* (TRAM_RAM28) TrustRAM Offset */
#define TRAM_RAM29_REG_OFST            _UINT32_(0x1074)    /* (TRAM_RAM29) TrustRAM Offset */
#define TRAM_RAM30_REG_OFST            _UINT32_(0x1078)    /* (TRAM_RAM30) TrustRAM Offset */
#define TRAM_RAM31_REG_OFST            _UINT32_(0x107C)    /* (TRAM_RAM31) TrustRAM Offset */
#define TRAM_RAM32_REG_OFST            _UINT32_(0x1080)    /* (TRAM_RAM32) TrustRAM Offset */
#define TRAM_RAM33_REG_OFST            _UINT32_(0x1084)    /* (TRAM_RAM33) TrustRAM Offset */
#define TRAM_RAM34_REG_OFST            _UINT32_(0x1088)    /* (TRAM_RAM34) TrustRAM Offset */
#define TRAM_RAM35_REG_OFST            _UINT32_(0x108C)    /* (TRAM_RAM35) TrustRAM Offset */
#define TRAM_RAM36_REG_OFST            _UINT32_(0x1090)    /* (TRAM_RAM36) TrustRAM Offset */
#define TRAM_RAM37_REG_OFST            _UINT32_(0x1094)    /* (TRAM_RAM37) TrustRAM Offset */
#define TRAM_RAM38_REG_OFST            _UINT32_(0x1098)    /* (TRAM_RAM38) TrustRAM Offset */
#define TRAM_RAM39_REG_OFST            _UINT32_(0x109C)    /* (TRAM_RAM39) TrustRAM Offset */
#define TRAM_RAM40_REG_OFST            _UINT32_(0x10A0)    /* (TRAM_RAM40) TrustRAM Offset */
#define TRAM_RAM41_REG_OFST            _UINT32_(0x10A4)    /* (TRAM_RAM41) TrustRAM Offset */
#define TRAM_RAM42_REG_OFST            _UINT32_(0x10A8)    /* (TRAM_RAM42) TrustRAM Offset */
#define TRAM_RAM43_REG_OFST            _UINT32_(0x10AC)    /* (TRAM_RAM43) TrustRAM Offset */
#define TRAM_RAM44_REG_OFST            _UINT32_(0x10B0)    /* (TRAM_RAM44) TrustRAM Offset */
#define TRAM_RAM45_REG_OFST            _UINT32_(0x10B4)    /* (TRAM_RAM45) TrustRAM Offset */
#define TRAM_RAM46_REG_OFST            _UINT32_(0x10B8)    /* (TRAM_RAM46) TrustRAM Offset */
#define TRAM_RAM47_REG_OFST            _UINT32_(0x10BC)    /* (TRAM_RAM47) TrustRAM Offset */
#define TRAM_RAM48_REG_OFST            _UINT32_(0x10C0)    /* (TRAM_RAM48) TrustRAM Offset */
#define TRAM_RAM49_REG_OFST            _UINT32_(0x10C4)    /* (TRAM_RAM49) TrustRAM Offset */
#define TRAM_RAM50_REG_OFST            _UINT32_(0x10C8)    /* (TRAM_RAM50) TrustRAM Offset */
#define TRAM_RAM51_REG_OFST            _UINT32_(0x10CC)    /* (TRAM_RAM51) TrustRAM Offset */
#define TRAM_RAM52_REG_OFST            _UINT32_(0x10D0)    /* (TRAM_RAM52) TrustRAM Offset */
#define TRAM_RAM53_REG_OFST            _UINT32_(0x10D4)    /* (TRAM_RAM53) TrustRAM Offset */
#define TRAM_RAM54_REG_OFST            _UINT32_(0x10D8)    /* (TRAM_RAM54) TrustRAM Offset */
#define TRAM_RAM55_REG_OFST            _UINT32_(0x10DC)    /* (TRAM_RAM55) TrustRAM Offset */
#define TRAM_RAM56_REG_OFST            _UINT32_(0x10E0)    /* (TRAM_RAM56) TrustRAM Offset */
#define TRAM_RAM57_REG_OFST            _UINT32_(0x10E4)    /* (TRAM_RAM57) TrustRAM Offset */
#define TRAM_RAM58_REG_OFST            _UINT32_(0x10E8)    /* (TRAM_RAM58) TrustRAM Offset */
#define TRAM_RAM59_REG_OFST            _UINT32_(0x10EC)    /* (TRAM_RAM59) TrustRAM Offset */
#define TRAM_RAM60_REG_OFST            _UINT32_(0x10F0)    /* (TRAM_RAM60) TrustRAM Offset */
#define TRAM_RAM61_REG_OFST            _UINT32_(0x10F4)    /* (TRAM_RAM61) TrustRAM Offset */
#define TRAM_RAM62_REG_OFST            _UINT32_(0x10F8)    /* (TRAM_RAM62) TrustRAM Offset */
#define TRAM_RAM63_REG_OFST            _UINT32_(0x10FC)    /* (TRAM_RAM63) TrustRAM Offset */
#define TRAM_RAM64_REG_OFST            _UINT32_(0x1100)    /* (TRAM_RAM64) TrustRAM Offset */
#define TRAM_RAM65_REG_OFST            _UINT32_(0x1104)    /* (TRAM_RAM65) TrustRAM Offset */
#define TRAM_RAM66_REG_OFST            _UINT32_(0x1108)    /* (TRAM_RAM66) TrustRAM Offset */
#define TRAM_RAM67_REG_OFST            _UINT32_(0x110C)    /* (TRAM_RAM67) TrustRAM Offset */
#define TRAM_RAM68_REG_OFST            _UINT32_(0x1110)    /* (TRAM_RAM68) TrustRAM Offset */
#define TRAM_RAM69_REG_OFST            _UINT32_(0x1114)    /* (TRAM_RAM69) TrustRAM Offset */
#define TRAM_RAM70_REG_OFST            _UINT32_(0x1118)    /* (TRAM_RAM70) TrustRAM Offset */
#define TRAM_RAM71_REG_OFST            _UINT32_(0x111C)    /* (TRAM_RAM71) TrustRAM Offset */
#define TRAM_RAM72_REG_OFST            _UINT32_(0x1120)    /* (TRAM_RAM72) TrustRAM Offset */
#define TRAM_RAM73_REG_OFST            _UINT32_(0x1124)    /* (TRAM_RAM73) TrustRAM Offset */
#define TRAM_RAM74_REG_OFST            _UINT32_(0x1128)    /* (TRAM_RAM74) TrustRAM Offset */
#define TRAM_RAM75_REG_OFST            _UINT32_(0x112C)    /* (TRAM_RAM75) TrustRAM Offset */
#define TRAM_RAM76_REG_OFST            _UINT32_(0x1130)    /* (TRAM_RAM76) TrustRAM Offset */
#define TRAM_RAM77_REG_OFST            _UINT32_(0x1134)    /* (TRAM_RAM77) TrustRAM Offset */
#define TRAM_RAM78_REG_OFST            _UINT32_(0x1138)    /* (TRAM_RAM78) TrustRAM Offset */
#define TRAM_RAM79_REG_OFST            _UINT32_(0x113C)    /* (TRAM_RAM79) TrustRAM Offset */
#define TRAM_RAM80_REG_OFST            _UINT32_(0x1140)    /* (TRAM_RAM80) TrustRAM Offset */
#define TRAM_RAM81_REG_OFST            _UINT32_(0x1144)    /* (TRAM_RAM81) TrustRAM Offset */
#define TRAM_RAM82_REG_OFST            _UINT32_(0x1148)    /* (TRAM_RAM82) TrustRAM Offset */
#define TRAM_RAM83_REG_OFST            _UINT32_(0x114C)    /* (TRAM_RAM83) TrustRAM Offset */
#define TRAM_RAM84_REG_OFST            _UINT32_(0x1150)    /* (TRAM_RAM84) TrustRAM Offset */
#define TRAM_RAM85_REG_OFST            _UINT32_(0x1154)    /* (TRAM_RAM85) TrustRAM Offset */
#define TRAM_RAM86_REG_OFST            _UINT32_(0x1158)    /* (TRAM_RAM86) TrustRAM Offset */
#define TRAM_RAM87_REG_OFST            _UINT32_(0x115C)    /* (TRAM_RAM87) TrustRAM Offset */
#define TRAM_RAM88_REG_OFST            _UINT32_(0x1160)    /* (TRAM_RAM88) TrustRAM Offset */
#define TRAM_RAM89_REG_OFST            _UINT32_(0x1164)    /* (TRAM_RAM89) TrustRAM Offset */
#define TRAM_RAM90_REG_OFST            _UINT32_(0x1168)    /* (TRAM_RAM90) TrustRAM Offset */
#define TRAM_RAM91_REG_OFST            _UINT32_(0x116C)    /* (TRAM_RAM91) TrustRAM Offset */
#define TRAM_RAM92_REG_OFST            _UINT32_(0x1170)    /* (TRAM_RAM92) TrustRAM Offset */
#define TRAM_RAM93_REG_OFST            _UINT32_(0x1174)    /* (TRAM_RAM93) TrustRAM Offset */
#define TRAM_RAM94_REG_OFST            _UINT32_(0x1178)    /* (TRAM_RAM94) TrustRAM Offset */
#define TRAM_RAM95_REG_OFST            _UINT32_(0x117C)    /* (TRAM_RAM95) TrustRAM Offset */
#define TRAM_RAM96_REG_OFST            _UINT32_(0x1180)    /* (TRAM_RAM96) TrustRAM Offset */
#define TRAM_RAM97_REG_OFST            _UINT32_(0x1184)    /* (TRAM_RAM97) TrustRAM Offset */
#define TRAM_RAM98_REG_OFST            _UINT32_(0x1188)    /* (TRAM_RAM98) TrustRAM Offset */
#define TRAM_RAM99_REG_OFST            _UINT32_(0x118C)    /* (TRAM_RAM99) TrustRAM Offset */
#define TRAM_RAM100_REG_OFST           _UINT32_(0x1190)    /* (TRAM_RAM100) TrustRAM Offset */
#define TRAM_RAM101_REG_OFST           _UINT32_(0x1194)    /* (TRAM_RAM101) TrustRAM Offset */
#define TRAM_RAM102_REG_OFST           _UINT32_(0x1198)    /* (TRAM_RAM102) TrustRAM Offset */
#define TRAM_RAM103_REG_OFST           _UINT32_(0x119C)    /* (TRAM_RAM103) TrustRAM Offset */
#define TRAM_RAM104_REG_OFST           _UINT32_(0x11A0)    /* (TRAM_RAM104) TrustRAM Offset */
#define TRAM_RAM105_REG_OFST           _UINT32_(0x11A4)    /* (TRAM_RAM105) TrustRAM Offset */
#define TRAM_RAM106_REG_OFST           _UINT32_(0x11A8)    /* (TRAM_RAM106) TrustRAM Offset */
#define TRAM_RAM107_REG_OFST           _UINT32_(0x11AC)    /* (TRAM_RAM107) TrustRAM Offset */
#define TRAM_RAM108_REG_OFST           _UINT32_(0x11B0)    /* (TRAM_RAM108) TrustRAM Offset */
#define TRAM_RAM109_REG_OFST           _UINT32_(0x11B4)    /* (TRAM_RAM109) TrustRAM Offset */
#define TRAM_RAM110_REG_OFST           _UINT32_(0x11B8)    /* (TRAM_RAM110) TrustRAM Offset */
#define TRAM_RAM111_REG_OFST           _UINT32_(0x11BC)    /* (TRAM_RAM111) TrustRAM Offset */
#define TRAM_RAM112_REG_OFST           _UINT32_(0x11C0)    /* (TRAM_RAM112) TrustRAM Offset */
#define TRAM_RAM113_REG_OFST           _UINT32_(0x11C4)    /* (TRAM_RAM113) TrustRAM Offset */
#define TRAM_RAM114_REG_OFST           _UINT32_(0x11C8)    /* (TRAM_RAM114) TrustRAM Offset */
#define TRAM_RAM115_REG_OFST           _UINT32_(0x11CC)    /* (TRAM_RAM115) TrustRAM Offset */
#define TRAM_RAM116_REG_OFST           _UINT32_(0x11D0)    /* (TRAM_RAM116) TrustRAM Offset */
#define TRAM_RAM117_REG_OFST           _UINT32_(0x11D4)    /* (TRAM_RAM117) TrustRAM Offset */
#define TRAM_RAM118_REG_OFST           _UINT32_(0x11D8)    /* (TRAM_RAM118) TrustRAM Offset */
#define TRAM_RAM119_REG_OFST           _UINT32_(0x11DC)    /* (TRAM_RAM119) TrustRAM Offset */
#define TRAM_RAM120_REG_OFST           _UINT32_(0x11E0)    /* (TRAM_RAM120) TrustRAM Offset */
#define TRAM_RAM121_REG_OFST           _UINT32_(0x11E4)    /* (TRAM_RAM121) TrustRAM Offset */
#define TRAM_RAM122_REG_OFST           _UINT32_(0x11E8)    /* (TRAM_RAM122) TrustRAM Offset */
#define TRAM_RAM123_REG_OFST           _UINT32_(0x11EC)    /* (TRAM_RAM123) TrustRAM Offset */
#define TRAM_RAM124_REG_OFST           _UINT32_(0x11F0)    /* (TRAM_RAM124) TrustRAM Offset */
#define TRAM_RAM125_REG_OFST           _UINT32_(0x11F4)    /* (TRAM_RAM125) TrustRAM Offset */
#define TRAM_RAM126_REG_OFST           _UINT32_(0x11F8)    /* (TRAM_RAM126) TrustRAM Offset */
#define TRAM_RAM127_REG_OFST           _UINT32_(0x11FC)    /* (TRAM_RAM127) TrustRAM Offset */
#define TRAM_RAM128_REG_OFST           _UINT32_(0x1200)    /* (TRAM_RAM128) TrustRAM Offset */
#define TRAM_RAM129_REG_OFST           _UINT32_(0x1204)    /* (TRAM_RAM129) TrustRAM Offset */
#define TRAM_RAM130_REG_OFST           _UINT32_(0x1208)    /* (TRAM_RAM130) TrustRAM Offset */
#define TRAM_RAM131_REG_OFST           _UINT32_(0x120C)    /* (TRAM_RAM131) TrustRAM Offset */
#define TRAM_RAM132_REG_OFST           _UINT32_(0x1210)    /* (TRAM_RAM132) TrustRAM Offset */
#define TRAM_RAM133_REG_OFST           _UINT32_(0x1214)    /* (TRAM_RAM133) TrustRAM Offset */
#define TRAM_RAM134_REG_OFST           _UINT32_(0x1218)    /* (TRAM_RAM134) TrustRAM Offset */
#define TRAM_RAM135_REG_OFST           _UINT32_(0x121C)    /* (TRAM_RAM135) TrustRAM Offset */
#define TRAM_RAM136_REG_OFST           _UINT32_(0x1220)    /* (TRAM_RAM136) TrustRAM Offset */
#define TRAM_RAM137_REG_OFST           _UINT32_(0x1224)    /* (TRAM_RAM137) TrustRAM Offset */
#define TRAM_RAM138_REG_OFST           _UINT32_(0x1228)    /* (TRAM_RAM138) TrustRAM Offset */
#define TRAM_RAM139_REG_OFST           _UINT32_(0x122C)    /* (TRAM_RAM139) TrustRAM Offset */
#define TRAM_RAM140_REG_OFST           _UINT32_(0x1230)    /* (TRAM_RAM140) TrustRAM Offset */
#define TRAM_RAM141_REG_OFST           _UINT32_(0x1234)    /* (TRAM_RAM141) TrustRAM Offset */
#define TRAM_RAM142_REG_OFST           _UINT32_(0x1238)    /* (TRAM_RAM142) TrustRAM Offset */
#define TRAM_RAM143_REG_OFST           _UINT32_(0x123C)    /* (TRAM_RAM143) TrustRAM Offset */
#define TRAM_RAM144_REG_OFST           _UINT32_(0x1240)    /* (TRAM_RAM144) TrustRAM Offset */
#define TRAM_RAM145_REG_OFST           _UINT32_(0x1244)    /* (TRAM_RAM145) TrustRAM Offset */
#define TRAM_RAM146_REG_OFST           _UINT32_(0x1248)    /* (TRAM_RAM146) TrustRAM Offset */
#define TRAM_RAM147_REG_OFST           _UINT32_(0x124C)    /* (TRAM_RAM147) TrustRAM Offset */
#define TRAM_RAM148_REG_OFST           _UINT32_(0x1250)    /* (TRAM_RAM148) TrustRAM Offset */
#define TRAM_RAM149_REG_OFST           _UINT32_(0x1254)    /* (TRAM_RAM149) TrustRAM Offset */
#define TRAM_RAM150_REG_OFST           _UINT32_(0x1258)    /* (TRAM_RAM150) TrustRAM Offset */
#define TRAM_RAM151_REG_OFST           _UINT32_(0x125C)    /* (TRAM_RAM151) TrustRAM Offset */
#define TRAM_RAM152_REG_OFST           _UINT32_(0x1260)    /* (TRAM_RAM152) TrustRAM Offset */
#define TRAM_RAM153_REG_OFST           _UINT32_(0x1264)    /* (TRAM_RAM153) TrustRAM Offset */
#define TRAM_RAM154_REG_OFST           _UINT32_(0x1268)    /* (TRAM_RAM154) TrustRAM Offset */
#define TRAM_RAM155_REG_OFST           _UINT32_(0x126C)    /* (TRAM_RAM155) TrustRAM Offset */
#define TRAM_RAM156_REG_OFST           _UINT32_(0x1270)    /* (TRAM_RAM156) TrustRAM Offset */
#define TRAM_RAM157_REG_OFST           _UINT32_(0x1274)    /* (TRAM_RAM157) TrustRAM Offset */
#define TRAM_RAM158_REG_OFST           _UINT32_(0x1278)    /* (TRAM_RAM158) TrustRAM Offset */
#define TRAM_RAM159_REG_OFST           _UINT32_(0x127C)    /* (TRAM_RAM159) TrustRAM Offset */
#define TRAM_RAM160_REG_OFST           _UINT32_(0x1280)    /* (TRAM_RAM160) TrustRAM Offset */
#define TRAM_RAM161_REG_OFST           _UINT32_(0x1284)    /* (TRAM_RAM161) TrustRAM Offset */
#define TRAM_RAM162_REG_OFST           _UINT32_(0x1288)    /* (TRAM_RAM162) TrustRAM Offset */
#define TRAM_RAM163_REG_OFST           _UINT32_(0x128C)    /* (TRAM_RAM163) TrustRAM Offset */
#define TRAM_RAM164_REG_OFST           _UINT32_(0x1290)    /* (TRAM_RAM164) TrustRAM Offset */
#define TRAM_RAM165_REG_OFST           _UINT32_(0x1294)    /* (TRAM_RAM165) TrustRAM Offset */
#define TRAM_RAM166_REG_OFST           _UINT32_(0x1298)    /* (TRAM_RAM166) TrustRAM Offset */
#define TRAM_RAM167_REG_OFST           _UINT32_(0x129C)    /* (TRAM_RAM167) TrustRAM Offset */
#define TRAM_RAM168_REG_OFST           _UINT32_(0x12A0)    /* (TRAM_RAM168) TrustRAM Offset */
#define TRAM_RAM169_REG_OFST           _UINT32_(0x12A4)    /* (TRAM_RAM169) TrustRAM Offset */
#define TRAM_RAM170_REG_OFST           _UINT32_(0x12A8)    /* (TRAM_RAM170) TrustRAM Offset */
#define TRAM_RAM171_REG_OFST           _UINT32_(0x12AC)    /* (TRAM_RAM171) TrustRAM Offset */
#define TRAM_RAM172_REG_OFST           _UINT32_(0x12B0)    /* (TRAM_RAM172) TrustRAM Offset */
#define TRAM_RAM173_REG_OFST           _UINT32_(0x12B4)    /* (TRAM_RAM173) TrustRAM Offset */
#define TRAM_RAM174_REG_OFST           _UINT32_(0x12B8)    /* (TRAM_RAM174) TrustRAM Offset */
#define TRAM_RAM175_REG_OFST           _UINT32_(0x12BC)    /* (TRAM_RAM175) TrustRAM Offset */
#define TRAM_RAM176_REG_OFST           _UINT32_(0x12C0)    /* (TRAM_RAM176) TrustRAM Offset */
#define TRAM_RAM177_REG_OFST           _UINT32_(0x12C4)    /* (TRAM_RAM177) TrustRAM Offset */
#define TRAM_RAM178_REG_OFST           _UINT32_(0x12C8)    /* (TRAM_RAM178) TrustRAM Offset */
#define TRAM_RAM179_REG_OFST           _UINT32_(0x12CC)    /* (TRAM_RAM179) TrustRAM Offset */
#define TRAM_RAM180_REG_OFST           _UINT32_(0x12D0)    /* (TRAM_RAM180) TrustRAM Offset */
#define TRAM_RAM181_REG_OFST           _UINT32_(0x12D4)    /* (TRAM_RAM181) TrustRAM Offset */
#define TRAM_RAM182_REG_OFST           _UINT32_(0x12D8)    /* (TRAM_RAM182) TrustRAM Offset */
#define TRAM_RAM183_REG_OFST           _UINT32_(0x12DC)    /* (TRAM_RAM183) TrustRAM Offset */
#define TRAM_RAM184_REG_OFST           _UINT32_(0x12E0)    /* (TRAM_RAM184) TrustRAM Offset */
#define TRAM_RAM185_REG_OFST           _UINT32_(0x12E4)    /* (TRAM_RAM185) TrustRAM Offset */
#define TRAM_RAM186_REG_OFST           _UINT32_(0x12E8)    /* (TRAM_RAM186) TrustRAM Offset */
#define TRAM_RAM187_REG_OFST           _UINT32_(0x12EC)    /* (TRAM_RAM187) TrustRAM Offset */
#define TRAM_RAM188_REG_OFST           _UINT32_(0x12F0)    /* (TRAM_RAM188) TrustRAM Offset */
#define TRAM_RAM189_REG_OFST           _UINT32_(0x12F4)    /* (TRAM_RAM189) TrustRAM Offset */
#define TRAM_RAM190_REG_OFST           _UINT32_(0x12F8)    /* (TRAM_RAM190) TrustRAM Offset */
#define TRAM_RAM191_REG_OFST           _UINT32_(0x12FC)    /* (TRAM_RAM191) TrustRAM Offset */
#define TRAM_RAM192_REG_OFST           _UINT32_(0x1300)    /* (TRAM_RAM192) TrustRAM Offset */
#define TRAM_RAM193_REG_OFST           _UINT32_(0x1304)    /* (TRAM_RAM193) TrustRAM Offset */
#define TRAM_RAM194_REG_OFST           _UINT32_(0x1308)    /* (TRAM_RAM194) TrustRAM Offset */
#define TRAM_RAM195_REG_OFST           _UINT32_(0x130C)    /* (TRAM_RAM195) TrustRAM Offset */
#define TRAM_RAM196_REG_OFST           _UINT32_(0x1310)    /* (TRAM_RAM196) TrustRAM Offset */
#define TRAM_RAM197_REG_OFST           _UINT32_(0x1314)    /* (TRAM_RAM197) TrustRAM Offset */
#define TRAM_RAM198_REG_OFST           _UINT32_(0x1318)    /* (TRAM_RAM198) TrustRAM Offset */
#define TRAM_RAM199_REG_OFST           _UINT32_(0x131C)    /* (TRAM_RAM199) TrustRAM Offset */
#define TRAM_RAM200_REG_OFST           _UINT32_(0x1320)    /* (TRAM_RAM200) TrustRAM Offset */
#define TRAM_RAM201_REG_OFST           _UINT32_(0x1324)    /* (TRAM_RAM201) TrustRAM Offset */
#define TRAM_RAM202_REG_OFST           _UINT32_(0x1328)    /* (TRAM_RAM202) TrustRAM Offset */
#define TRAM_RAM203_REG_OFST           _UINT32_(0x132C)    /* (TRAM_RAM203) TrustRAM Offset */
#define TRAM_RAM204_REG_OFST           _UINT32_(0x1330)    /* (TRAM_RAM204) TrustRAM Offset */
#define TRAM_RAM205_REG_OFST           _UINT32_(0x1334)    /* (TRAM_RAM205) TrustRAM Offset */
#define TRAM_RAM206_REG_OFST           _UINT32_(0x1338)    /* (TRAM_RAM206) TrustRAM Offset */
#define TRAM_RAM207_REG_OFST           _UINT32_(0x133C)    /* (TRAM_RAM207) TrustRAM Offset */
#define TRAM_RAM208_REG_OFST           _UINT32_(0x1340)    /* (TRAM_RAM208) TrustRAM Offset */
#define TRAM_RAM209_REG_OFST           _UINT32_(0x1344)    /* (TRAM_RAM209) TrustRAM Offset */
#define TRAM_RAM210_REG_OFST           _UINT32_(0x1348)    /* (TRAM_RAM210) TrustRAM Offset */
#define TRAM_RAM211_REG_OFST           _UINT32_(0x134C)    /* (TRAM_RAM211) TrustRAM Offset */
#define TRAM_RAM212_REG_OFST           _UINT32_(0x1350)    /* (TRAM_RAM212) TrustRAM Offset */
#define TRAM_RAM213_REG_OFST           _UINT32_(0x1354)    /* (TRAM_RAM213) TrustRAM Offset */
#define TRAM_RAM214_REG_OFST           _UINT32_(0x1358)    /* (TRAM_RAM214) TrustRAM Offset */
#define TRAM_RAM215_REG_OFST           _UINT32_(0x135C)    /* (TRAM_RAM215) TrustRAM Offset */
#define TRAM_RAM216_REG_OFST           _UINT32_(0x1360)    /* (TRAM_RAM216) TrustRAM Offset */
#define TRAM_RAM217_REG_OFST           _UINT32_(0x1364)    /* (TRAM_RAM217) TrustRAM Offset */
#define TRAM_RAM218_REG_OFST           _UINT32_(0x1368)    /* (TRAM_RAM218) TrustRAM Offset */
#define TRAM_RAM219_REG_OFST           _UINT32_(0x136C)    /* (TRAM_RAM219) TrustRAM Offset */
#define TRAM_RAM220_REG_OFST           _UINT32_(0x1370)    /* (TRAM_RAM220) TrustRAM Offset */
#define TRAM_RAM221_REG_OFST           _UINT32_(0x1374)    /* (TRAM_RAM221) TrustRAM Offset */
#define TRAM_RAM222_REG_OFST           _UINT32_(0x1378)    /* (TRAM_RAM222) TrustRAM Offset */
#define TRAM_RAM223_REG_OFST           _UINT32_(0x137C)    /* (TRAM_RAM223) TrustRAM Offset */
#define TRAM_RAM224_REG_OFST           _UINT32_(0x1380)    /* (TRAM_RAM224) TrustRAM Offset */
#define TRAM_RAM225_REG_OFST           _UINT32_(0x1384)    /* (TRAM_RAM225) TrustRAM Offset */
#define TRAM_RAM226_REG_OFST           _UINT32_(0x1388)    /* (TRAM_RAM226) TrustRAM Offset */
#define TRAM_RAM227_REG_OFST           _UINT32_(0x138C)    /* (TRAM_RAM227) TrustRAM Offset */
#define TRAM_RAM228_REG_OFST           _UINT32_(0x1390)    /* (TRAM_RAM228) TrustRAM Offset */
#define TRAM_RAM229_REG_OFST           _UINT32_(0x1394)    /* (TRAM_RAM229) TrustRAM Offset */
#define TRAM_RAM230_REG_OFST           _UINT32_(0x1398)    /* (TRAM_RAM230) TrustRAM Offset */
#define TRAM_RAM231_REG_OFST           _UINT32_(0x139C)    /* (TRAM_RAM231) TrustRAM Offset */
#define TRAM_RAM232_REG_OFST           _UINT32_(0x13A0)    /* (TRAM_RAM232) TrustRAM Offset */
#define TRAM_RAM233_REG_OFST           _UINT32_(0x13A4)    /* (TRAM_RAM233) TrustRAM Offset */
#define TRAM_RAM234_REG_OFST           _UINT32_(0x13A8)    /* (TRAM_RAM234) TrustRAM Offset */
#define TRAM_RAM235_REG_OFST           _UINT32_(0x13AC)    /* (TRAM_RAM235) TrustRAM Offset */
#define TRAM_RAM236_REG_OFST           _UINT32_(0x13B0)    /* (TRAM_RAM236) TrustRAM Offset */
#define TRAM_RAM237_REG_OFST           _UINT32_(0x13B4)    /* (TRAM_RAM237) TrustRAM Offset */
#define TRAM_RAM238_REG_OFST           _UINT32_(0x13B8)    /* (TRAM_RAM238) TrustRAM Offset */
#define TRAM_RAM239_REG_OFST           _UINT32_(0x13BC)    /* (TRAM_RAM239) TrustRAM Offset */
#define TRAM_RAM240_REG_OFST           _UINT32_(0x13C0)    /* (TRAM_RAM240) TrustRAM Offset */
#define TRAM_RAM241_REG_OFST           _UINT32_(0x13C4)    /* (TRAM_RAM241) TrustRAM Offset */
