Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/tram.h
#define TRAM_RAM242_REG_OFST           _UINT32_(0x13C8)    /* (TRAM_RAM242) TrustRAM Offset */
#define TRAM_RAM243_REG_OFST           _UINT32_(0x13CC)    /* (TRAM_RAM243) TrustRAM Offset */
#define TRAM_RAM244_REG_OFST           _UINT32_(0x13D0)    /* (TRAM_RAM244) TrustRAM Offset */
#define TRAM_RAM245_REG_OFST           _UINT32_(0x13D4)    /* (TRAM_RAM245) TrustRAM Offset */
#define TRAM_RAM246_REG_OFST           _UINT32_(0x13D8)    /* (TRAM_RAM246) TrustRAM Offset */
#define TRAM_RAM247_REG_OFST           _UINT32_(0x13DC)    /* (TRAM_RAM247) TrustRAM Offset */
#define TRAM_RAM248_REG_OFST           _UINT32_(0x13E0)    /* (TRAM_RAM248) TrustRAM Offset */
#define TRAM_RAM249_REG_OFST           _UINT32_(0x13E4)    /* (TRAM_RAM249) TrustRAM Offset */
#define TRAM_RAM250_REG_OFST           _UINT32_(0x13E8)    /* (TRAM_RAM250) TrustRAM Offset */
#define TRAM_RAM251_REG_OFST           _UINT32_(0x13EC)    /* (TRAM_RAM251) TrustRAM Offset */
#define TRAM_RAM252_REG_OFST           _UINT32_(0x13F0)    /* (TRAM_RAM252) TrustRAM Offset */
#define TRAM_RAM253_REG_OFST           _UINT32_(0x13F4)    /* (TRAM_RAM253) TrustRAM Offset */
#define TRAM_RAM254_REG_OFST           _UINT32_(0x13F8)    /* (TRAM_RAM254) TrustRAM Offset */
#define TRAM_RAM255_REG_OFST           _UINT32_(0x13FC)    /* (TRAM_RAM255) TrustRAM Offset */
#define TRAM_RAM256_REG_OFST           _UINT32_(0x1400)    /* (TRAM_RAM256) TrustRAM Offset */
#define TRAM_RAM257_REG_OFST           _UINT32_(0x1404)    /* (TRAM_RAM257) TrustRAM Offset */
#define TRAM_RAM258_REG_OFST           _UINT32_(0x1408)    /* (TRAM_RAM258) TrustRAM Offset */
#define TRAM_RAM259_REG_OFST           _UINT32_(0x140C)    /* (TRAM_RAM259) TrustRAM Offset */
#define TRAM_RAM260_REG_OFST           _UINT32_(0x1410)    /* (TRAM_RAM260) TrustRAM Offset */
#define TRAM_RAM261_REG_OFST           _UINT32_(0x1414)    /* (TRAM_RAM261) TrustRAM Offset */
#define TRAM_RAM262_REG_OFST           _UINT32_(0x1418)    /* (TRAM_RAM262) TrustRAM Offset */
#define TRAM_RAM263_REG_OFST           _UINT32_(0x141C)    /* (TRAM_RAM263) TrustRAM Offset */
#define TRAM_RAM264_REG_OFST           _UINT32_(0x1420)    /* (TRAM_RAM264) TrustRAM Offset */
#define TRAM_RAM265_REG_OFST           _UINT32_(0x1424)    /* (TRAM_RAM265) TrustRAM Offset */
#define TRAM_RAM266_REG_OFST           _UINT32_(0x1428)    /* (TRAM_RAM266) TrustRAM Offset */
#define TRAM_RAM267_REG_OFST           _UINT32_(0x142C)    /* (TRAM_RAM267) TrustRAM Offset */
#define TRAM_RAM268_REG_OFST           _UINT32_(0x1430)    /* (TRAM_RAM268) TrustRAM Offset */
#define TRAM_RAM269_REG_OFST           _UINT32_(0x1434)    /* (TRAM_RAM269) TrustRAM Offset */
#define TRAM_RAM270_REG_OFST           _UINT32_(0x1438)    /* (TRAM_RAM270) TrustRAM Offset */
#define TRAM_RAM271_REG_OFST           _UINT32_(0x143C)    /* (TRAM_RAM271) TrustRAM Offset */
#define TRAM_RAM272_REG_OFST           _UINT32_(0x1440)    /* (TRAM_RAM272) TrustRAM Offset */
#define TRAM_RAM273_REG_OFST           _UINT32_(0x1444)    /* (TRAM_RAM273) TrustRAM Offset */
#define TRAM_RAM274_REG_OFST           _UINT32_(0x1448)    /* (TRAM_RAM274) TrustRAM Offset */
#define TRAM_RAM275_REG_OFST           _UINT32_(0x144C)    /* (TRAM_RAM275) TrustRAM Offset */
#define TRAM_RAM276_REG_OFST           _UINT32_(0x1450)    /* (TRAM_RAM276) TrustRAM Offset */
#define TRAM_RAM277_REG_OFST           _UINT32_(0x1454)    /* (TRAM_RAM277) TrustRAM Offset */
#define TRAM_RAM278_REG_OFST           _UINT32_(0x1458)    /* (TRAM_RAM278) TrustRAM Offset */
#define TRAM_RAM279_REG_OFST           _UINT32_(0x145C)    /* (TRAM_RAM279) TrustRAM Offset */
#define TRAM_RAM280_REG_OFST           _UINT32_(0x1460)    /* (TRAM_RAM280) TrustRAM Offset */
#define TRAM_RAM281_REG_OFST           _UINT32_(0x1464)    /* (TRAM_RAM281) TrustRAM Offset */
#define TRAM_RAM282_REG_OFST           _UINT32_(0x1468)    /* (TRAM_RAM282) TrustRAM Offset */
#define TRAM_RAM283_REG_OFST           _UINT32_(0x146C)    /* (TRAM_RAM283) TrustRAM Offset */
#define TRAM_RAM284_REG_OFST           _UINT32_(0x1470)    /* (TRAM_RAM284) TrustRAM Offset */
#define TRAM_RAM285_REG_OFST           _UINT32_(0x1474)    /* (TRAM_RAM285) TrustRAM Offset */
#define TRAM_RAM286_REG_OFST           _UINT32_(0x1478)    /* (TRAM_RAM286) TrustRAM Offset */
#define TRAM_RAM287_REG_OFST           _UINT32_(0x147C)    /* (TRAM_RAM287) TrustRAM Offset */
#define TRAM_RAM288_REG_OFST           _UINT32_(0x1480)    /* (TRAM_RAM288) TrustRAM Offset */
#define TRAM_RAM289_REG_OFST           _UINT32_(0x1484)    /* (TRAM_RAM289) TrustRAM Offset */
#define TRAM_RAM290_REG_OFST           _UINT32_(0x1488)    /* (TRAM_RAM290) TrustRAM Offset */
#define TRAM_RAM291_REG_OFST           _UINT32_(0x148C)    /* (TRAM_RAM291) TrustRAM Offset */
#define TRAM_RAM292_REG_OFST           _UINT32_(0x1490)    /* (TRAM_RAM292) TrustRAM Offset */
#define TRAM_RAM293_REG_OFST           _UINT32_(0x1494)    /* (TRAM_RAM293) TrustRAM Offset */
#define TRAM_RAM294_REG_OFST           _UINT32_(0x1498)    /* (TRAM_RAM294) TrustRAM Offset */
#define TRAM_RAM295_REG_OFST           _UINT32_(0x149C)    /* (TRAM_RAM295) TrustRAM Offset */
#define TRAM_RAM296_REG_OFST           _UINT32_(0x14A0)    /* (TRAM_RAM296) TrustRAM Offset */
#define TRAM_RAM297_REG_OFST           _UINT32_(0x14A4)    /* (TRAM_RAM297) TrustRAM Offset */
#define TRAM_RAM298_REG_OFST           _UINT32_(0x14A8)    /* (TRAM_RAM298) TrustRAM Offset */
#define TRAM_RAM299_REG_OFST           _UINT32_(0x14AC)    /* (TRAM_RAM299) TrustRAM Offset */
#define TRAM_RAM300_REG_OFST           _UINT32_(0x14B0)    /* (TRAM_RAM300) TrustRAM Offset */
#define TRAM_RAM301_REG_OFST           _UINT32_(0x14B4)    /* (TRAM_RAM301) TrustRAM Offset */
#define TRAM_RAM302_REG_OFST           _UINT32_(0x14B8)    /* (TRAM_RAM302) TrustRAM Offset */
#define TRAM_RAM303_REG_OFST           _UINT32_(0x14BC)    /* (TRAM_RAM303) TrustRAM Offset */
#define TRAM_RAM304_REG_OFST           _UINT32_(0x14C0)    /* (TRAM_RAM304) TrustRAM Offset */
#define TRAM_RAM305_REG_OFST           _UINT32_(0x14C4)    /* (TRAM_RAM305) TrustRAM Offset */
#define TRAM_RAM306_REG_OFST           _UINT32_(0x14C8)    /* (TRAM_RAM306) TrustRAM Offset */
#define TRAM_RAM307_REG_OFST           _UINT32_(0x14CC)    /* (TRAM_RAM307) TrustRAM Offset */
#define TRAM_RAM308_REG_OFST           _UINT32_(0x14D0)    /* (TRAM_RAM308) TrustRAM Offset */
#define TRAM_RAM309_REG_OFST           _UINT32_(0x14D4)    /* (TRAM_RAM309) TrustRAM Offset */
#define TRAM_RAM310_REG_OFST           _UINT32_(0x14D8)    /* (TRAM_RAM310) TrustRAM Offset */
#define TRAM_RAM311_REG_OFST           _UINT32_(0x14DC)    /* (TRAM_RAM311) TrustRAM Offset */
#define TRAM_RAM312_REG_OFST           _UINT32_(0x14E0)    /* (TRAM_RAM312) TrustRAM Offset */
#define TRAM_RAM313_REG_OFST           _UINT32_(0x14E4)    /* (TRAM_RAM313) TrustRAM Offset */
#define TRAM_RAM314_REG_OFST           _UINT32_(0x14E8)    /* (TRAM_RAM314) TrustRAM Offset */
#define TRAM_RAM315_REG_OFST           _UINT32_(0x14EC)    /* (TRAM_RAM315) TrustRAM Offset */
#define TRAM_RAM316_REG_OFST           _UINT32_(0x14F0)    /* (TRAM_RAM316) TrustRAM Offset */
#define TRAM_RAM317_REG_OFST           _UINT32_(0x14F4)    /* (TRAM_RAM317) TrustRAM Offset */
#define TRAM_RAM318_REG_OFST           _UINT32_(0x14F8)    /* (TRAM_RAM318) TrustRAM Offset */
#define TRAM_RAM319_REG_OFST           _UINT32_(0x14FC)    /* (TRAM_RAM319) TrustRAM Offset */
#define TRAM_RAM320_REG_OFST           _UINT32_(0x1500)    /* (TRAM_RAM320) TrustRAM Offset */
#define TRAM_RAM321_REG_OFST           _UINT32_(0x1504)    /* (TRAM_RAM321) TrustRAM Offset */
#define TRAM_RAM322_REG_OFST           _UINT32_(0x1508)    /* (TRAM_RAM322) TrustRAM Offset */
#define TRAM_RAM323_REG_OFST           _UINT32_(0x150C)    /* (TRAM_RAM323) TrustRAM Offset */
#define TRAM_RAM324_REG_OFST           _UINT32_(0x1510)    /* (TRAM_RAM324) TrustRAM Offset */
#define TRAM_RAM325_REG_OFST           _UINT32_(0x1514)    /* (TRAM_RAM325) TrustRAM Offset */
#define TRAM_RAM326_REG_OFST           _UINT32_(0x1518)    /* (TRAM_RAM326) TrustRAM Offset */
#define TRAM_RAM327_REG_OFST           _UINT32_(0x151C)    /* (TRAM_RAM327) TrustRAM Offset */
#define TRAM_RAM328_REG_OFST           _UINT32_(0x1520)    /* (TRAM_RAM328) TrustRAM Offset */
#define TRAM_RAM329_REG_OFST           _UINT32_(0x1524)    /* (TRAM_RAM329) TrustRAM Offset */
#define TRAM_RAM330_REG_OFST           _UINT32_(0x1528)    /* (TRAM_RAM330) TrustRAM Offset */
#define TRAM_RAM331_REG_OFST           _UINT32_(0x152C)    /* (TRAM_RAM331) TrustRAM Offset */
#define TRAM_RAM332_REG_OFST           _UINT32_(0x1530)    /* (TRAM_RAM332) TrustRAM Offset */
#define TRAM_RAM333_REG_OFST           _UINT32_(0x1534)    /* (TRAM_RAM333) TrustRAM Offset */
#define TRAM_RAM334_REG_OFST           _UINT32_(0x1538)    /* (TRAM_RAM334) TrustRAM Offset */
#define TRAM_RAM335_REG_OFST           _UINT32_(0x153C)    /* (TRAM_RAM335) TrustRAM Offset */
#define TRAM_RAM336_REG_OFST           _UINT32_(0x1540)    /* (TRAM_RAM336) TrustRAM Offset */
#define TRAM_RAM337_REG_OFST           _UINT32_(0x1544)    /* (TRAM_RAM337) TrustRAM Offset */
#define TRAM_RAM338_REG_OFST           _UINT32_(0x1548)    /* (TRAM_RAM338) TrustRAM Offset */
#define TRAM_RAM339_REG_OFST           _UINT32_(0x154C)    /* (TRAM_RAM339) TrustRAM Offset */
#define TRAM_RAM340_REG_OFST           _UINT32_(0x1550)    /* (TRAM_RAM340) TrustRAM Offset */
#define TRAM_RAM341_REG_OFST           _UINT32_(0x1554)    /* (TRAM_RAM341) TrustRAM Offset */
#define TRAM_RAM342_REG_OFST           _UINT32_(0x1558)    /* (TRAM_RAM342) TrustRAM Offset */
#define TRAM_RAM343_REG_OFST           _UINT32_(0x155C)    /* (TRAM_RAM343) TrustRAM Offset */
#define TRAM_RAM344_REG_OFST           _UINT32_(0x1560)    /* (TRAM_RAM344) TrustRAM Offset */
#define TRAM_RAM345_REG_OFST           _UINT32_(0x1564)    /* (TRAM_RAM345) TrustRAM Offset */
#define TRAM_RAM346_REG_OFST           _UINT32_(0x1568)    /* (TRAM_RAM346) TrustRAM Offset */
#define TRAM_RAM347_REG_OFST           _UINT32_(0x156C)    /* (TRAM_RAM347) TrustRAM Offset */
#define TRAM_RAM348_REG_OFST           _UINT32_(0x1570)    /* (TRAM_RAM348) TrustRAM Offset */
#define TRAM_RAM349_REG_OFST           _UINT32_(0x1574)    /* (TRAM_RAM349) TrustRAM Offset */
#define TRAM_RAM350_REG_OFST           _UINT32_(0x1578)    /* (TRAM_RAM350) TrustRAM Offset */
#define TRAM_RAM351_REG_OFST           _UINT32_(0x157C)    /* (TRAM_RAM351) TrustRAM Offset */
#define TRAM_RAM352_REG_OFST           _UINT32_(0x1580)    /* (TRAM_RAM352) TrustRAM Offset */
#define TRAM_RAM353_REG_OFST           _UINT32_(0x1584)    /* (TRAM_RAM353) TrustRAM Offset */
#define TRAM_RAM354_REG_OFST           _UINT32_(0x1588)    /* (TRAM_RAM354) TrustRAM Offset */
#define TRAM_RAM355_REG_OFST           _UINT32_(0x158C)    /* (TRAM_RAM355) TrustRAM Offset */
#define TRAM_RAM356_REG_OFST           _UINT32_(0x1590)    /* (TRAM_RAM356) TrustRAM Offset */
#define TRAM_RAM357_REG_OFST           _UINT32_(0x1594)    /* (TRAM_RAM357) TrustRAM Offset */
#define TRAM_RAM358_REG_OFST           _UINT32_(0x1598)    /* (TRAM_RAM358) TrustRAM Offset */
#define TRAM_RAM359_REG_OFST           _UINT32_(0x159C)    /* (TRAM_RAM359) TrustRAM Offset */
#define TRAM_RAM360_REG_OFST           _UINT32_(0x15A0)    /* (TRAM_RAM360) TrustRAM Offset */
#define TRAM_RAM361_REG_OFST           _UINT32_(0x15A4)    /* (TRAM_RAM361) TrustRAM Offset */
#define TRAM_RAM362_REG_OFST           _UINT32_(0x15A8)    /* (TRAM_RAM362) TrustRAM Offset */
#define TRAM_RAM363_REG_OFST           _UINT32_(0x15AC)    /* (TRAM_RAM363) TrustRAM Offset */
#define TRAM_RAM364_REG_OFST           _UINT32_(0x15B0)    /* (TRAM_RAM364) TrustRAM Offset */
#define TRAM_RAM365_REG_OFST           _UINT32_(0x15B4)    /* (TRAM_RAM365) TrustRAM Offset */
#define TRAM_RAM366_REG_OFST           _UINT32_(0x15B8)    /* (TRAM_RAM366) TrustRAM Offset */
#define TRAM_RAM367_REG_OFST           _UINT32_(0x15BC)    /* (TRAM_RAM367) TrustRAM Offset */
#define TRAM_RAM368_REG_OFST           _UINT32_(0x15C0)    /* (TRAM_RAM368) TrustRAM Offset */
#define TRAM_RAM369_REG_OFST           _UINT32_(0x15C4)    /* (TRAM_RAM369) TrustRAM Offset */
#define TRAM_RAM370_REG_OFST           _UINT32_(0x15C8)    /* (TRAM_RAM370) TrustRAM Offset */
#define TRAM_RAM371_REG_OFST           _UINT32_(0x15CC)    /* (TRAM_RAM371) TrustRAM Offset */
#define TRAM_RAM372_REG_OFST           _UINT32_(0x15D0)    /* (TRAM_RAM372) TrustRAM Offset */
#define TRAM_RAM373_REG_OFST           _UINT32_(0x15D4)    /* (TRAM_RAM373) TrustRAM Offset */
#define TRAM_RAM374_REG_OFST           _UINT32_(0x15D8)    /* (TRAM_RAM374) TrustRAM Offset */
#define TRAM_RAM375_REG_OFST           _UINT32_(0x15DC)    /* (TRAM_RAM375) TrustRAM Offset */
#define TRAM_RAM376_REG_OFST           _UINT32_(0x15E0)    /* (TRAM_RAM376) TrustRAM Offset */
#define TRAM_RAM377_REG_OFST           _UINT32_(0x15E4)    /* (TRAM_RAM377) TrustRAM Offset */
#define TRAM_RAM378_REG_OFST           _UINT32_(0x15E8)    /* (TRAM_RAM378) TrustRAM Offset */
#define TRAM_RAM379_REG_OFST           _UINT32_(0x15EC)    /* (TRAM_RAM379) TrustRAM Offset */
#define TRAM_RAM380_REG_OFST           _UINT32_(0x15F0)    /* (TRAM_RAM380) TrustRAM Offset */
#define TRAM_RAM381_REG_OFST           _UINT32_(0x15F4)    /* (TRAM_RAM381) TrustRAM Offset */
#define TRAM_RAM382_REG_OFST           _UINT32_(0x15F8)    /* (TRAM_RAM382) TrustRAM Offset */
#define TRAM_RAM383_REG_OFST           _UINT32_(0x15FC)    /* (TRAM_RAM383) TrustRAM Offset */
#define TRAM_RAM384_REG_OFST           _UINT32_(0x1600)    /* (TRAM_RAM384) TrustRAM Offset */
#define TRAM_RAM385_REG_OFST           _UINT32_(0x1604)    /* (TRAM_RAM385) TrustRAM Offset */
#define TRAM_RAM386_REG_OFST           _UINT32_(0x1608)    /* (TRAM_RAM386) TrustRAM Offset */
#define TRAM_RAM387_REG_OFST           _UINT32_(0x160C)    /* (TRAM_RAM387) TrustRAM Offset */
#define TRAM_RAM388_REG_OFST           _UINT32_(0x1610)    /* (TRAM_RAM388) TrustRAM Offset */
#define TRAM_RAM389_REG_OFST           _UINT32_(0x1614)    /* (TRAM_RAM389) TrustRAM Offset */
#define TRAM_RAM390_REG_OFST           _UINT32_(0x1618)    /* (TRAM_RAM390) TrustRAM Offset */
#define TRAM_RAM391_REG_OFST           _UINT32_(0x161C)    /* (TRAM_RAM391) TrustRAM Offset */
#define TRAM_RAM392_REG_OFST           _UINT32_(0x1620)    /* (TRAM_RAM392) TrustRAM Offset */
#define TRAM_RAM393_REG_OFST           _UINT32_(0x1624)    /* (TRAM_RAM393) TrustRAM Offset */
#define TRAM_RAM394_REG_OFST           _UINT32_(0x1628)    /* (TRAM_RAM394) TrustRAM Offset */
#define TRAM_RAM395_REG_OFST           _UINT32_(0x162C)    /* (TRAM_RAM395) TrustRAM Offset */
#define TRAM_RAM396_REG_OFST           _UINT32_(0x1630)    /* (TRAM_RAM396) TrustRAM Offset */
#define TRAM_RAM397_REG_OFST           _UINT32_(0x1634)    /* (TRAM_RAM397) TrustRAM Offset */
#define TRAM_RAM398_REG_OFST           _UINT32_(0x1638)    /* (TRAM_RAM398) TrustRAM Offset */
#define TRAM_RAM399_REG_OFST           _UINT32_(0x163C)    /* (TRAM_RAM399) TrustRAM Offset */
#define TRAM_RAM400_REG_OFST           _UINT32_(0x1640)    /* (TRAM_RAM400) TrustRAM Offset */
#define TRAM_RAM401_REG_OFST           _UINT32_(0x1644)    /* (TRAM_RAM401) TrustRAM Offset */
#define TRAM_RAM402_REG_OFST           _UINT32_(0x1648)    /* (TRAM_RAM402) TrustRAM Offset */
#define TRAM_RAM403_REG_OFST           _UINT32_(0x164C)    /* (TRAM_RAM403) TrustRAM Offset */
#define TRAM_RAM404_REG_OFST           _UINT32_(0x1650)    /* (TRAM_RAM404) TrustRAM Offset */
#define TRAM_RAM405_REG_OFST           _UINT32_(0x1654)    /* (TRAM_RAM405) TrustRAM Offset */
#define TRAM_RAM406_REG_OFST           _UINT32_(0x1658)    /* (TRAM_RAM406) TrustRAM Offset */
#define TRAM_RAM407_REG_OFST           _UINT32_(0x165C)    /* (TRAM_RAM407) TrustRAM Offset */
#define TRAM_RAM408_REG_OFST           _UINT32_(0x1660)    /* (TRAM_RAM408) TrustRAM Offset */
#define TRAM_RAM409_REG_OFST           _UINT32_(0x1664)    /* (TRAM_RAM409) TrustRAM Offset */
#define TRAM_RAM410_REG_OFST           _UINT32_(0x1668)    /* (TRAM_RAM410) TrustRAM Offset */
#define TRAM_RAM411_REG_OFST           _UINT32_(0x166C)    /* (TRAM_RAM411) TrustRAM Offset */
#define TRAM_RAM412_REG_OFST           _UINT32_(0x1670)    /* (TRAM_RAM412) TrustRAM Offset */
#define TRAM_RAM413_REG_OFST           _UINT32_(0x1674)    /* (TRAM_RAM413) TrustRAM Offset */
#define TRAM_RAM414_REG_OFST           _UINT32_(0x1678)    /* (TRAM_RAM414) TrustRAM Offset */
#define TRAM_RAM415_REG_OFST           _UINT32_(0x167C)    /* (TRAM_RAM415) TrustRAM Offset */
#define TRAM_RAM416_REG_OFST           _UINT32_(0x1680)    /* (TRAM_RAM416) TrustRAM Offset */
#define TRAM_RAM417_REG_OFST           _UINT32_(0x1684)    /* (TRAM_RAM417) TrustRAM Offset */
#define TRAM_RAM418_REG_OFST           _UINT32_(0x1688)    /* (TRAM_RAM418) TrustRAM Offset */
#define TRAM_RAM419_REG_OFST           _UINT32_(0x168C)    /* (TRAM_RAM419) TrustRAM Offset */
#define TRAM_RAM420_REG_OFST           _UINT32_(0x1690)    /* (TRAM_RAM420) TrustRAM Offset */
#define TRAM_RAM421_REG_OFST           _UINT32_(0x1694)    /* (TRAM_RAM421) TrustRAM Offset */
#define TRAM_RAM422_REG_OFST           _UINT32_(0x1698)    /* (TRAM_RAM422) TrustRAM Offset */
#define TRAM_RAM423_REG_OFST           _UINT32_(0x169C)    /* (TRAM_RAM423) TrustRAM Offset */
#define TRAM_RAM424_REG_OFST           _UINT32_(0x16A0)    /* (TRAM_RAM424) TrustRAM Offset */
#define TRAM_RAM425_REG_OFST           _UINT32_(0x16A4)    /* (TRAM_RAM425) TrustRAM Offset */
#define TRAM_RAM426_REG_OFST           _UINT32_(0x16A8)    /* (TRAM_RAM426) TrustRAM Offset */
#define TRAM_RAM427_REG_OFST           _UINT32_(0x16AC)    /* (TRAM_RAM427) TrustRAM Offset */
#define TRAM_RAM428_REG_OFST           _UINT32_(0x16B0)    /* (TRAM_RAM428) TrustRAM Offset */
#define TRAM_RAM429_REG_OFST           _UINT32_(0x16B4)    /* (TRAM_RAM429) TrustRAM Offset */
#define TRAM_RAM430_REG_OFST           _UINT32_(0x16B8)    /* (TRAM_RAM430) TrustRAM Offset */
#define TRAM_RAM431_REG_OFST           _UINT32_(0x16BC)    /* (TRAM_RAM431) TrustRAM Offset */
#define TRAM_RAM432_REG_OFST           _UINT32_(0x16C0)    /* (TRAM_RAM432) TrustRAM Offset */
#define TRAM_RAM433_REG_OFST           _UINT32_(0x16C4)    /* (TRAM_RAM433) TrustRAM Offset */
#define TRAM_RAM434_REG_OFST           _UINT32_(0x16C8)    /* (TRAM_RAM434) TrustRAM Offset */
#define TRAM_RAM435_REG_OFST           _UINT32_(0x16CC)    /* (TRAM_RAM435) TrustRAM Offset */
#define TRAM_RAM436_REG_OFST           _UINT32_(0x16D0)    /* (TRAM_RAM436) TrustRAM Offset */
#define TRAM_RAM437_REG_OFST           _UINT32_(0x16D4)    /* (TRAM_RAM437) TrustRAM Offset */
#define TRAM_RAM438_REG_OFST           _UINT32_(0x16D8)    /* (TRAM_RAM438) TrustRAM Offset */
#define TRAM_RAM439_REG_OFST           _UINT32_(0x16DC)    /* (TRAM_RAM439) TrustRAM Offset */
#define TRAM_RAM440_REG_OFST           _UINT32_(0x16E0)    /* (TRAM_RAM440) TrustRAM Offset */
#define TRAM_RAM441_REG_OFST           _UINT32_(0x16E4)    /* (TRAM_RAM441) TrustRAM Offset */
#define TRAM_RAM442_REG_OFST           _UINT32_(0x16E8)    /* (TRAM_RAM442) TrustRAM Offset */
#define TRAM_RAM443_REG_OFST           _UINT32_(0x16EC)    /* (TRAM_RAM443) TrustRAM Offset */
#define TRAM_RAM444_REG_OFST           _UINT32_(0x16F0)    /* (TRAM_RAM444) TrustRAM Offset */
#define TRAM_RAM445_REG_OFST           _UINT32_(0x16F4)    /* (TRAM_RAM445) TrustRAM Offset */
#define TRAM_RAM446_REG_OFST           _UINT32_(0x16F8)    /* (TRAM_RAM446) TrustRAM Offset */
#define TRAM_RAM447_REG_OFST           _UINT32_(0x16FC)    /* (TRAM_RAM447) TrustRAM Offset */
#define TRAM_RAM448_REG_OFST           _UINT32_(0x1700)    /* (TRAM_RAM448) TrustRAM Offset */
#define TRAM_RAM449_REG_OFST           _UINT32_(0x1704)    /* (TRAM_RAM449) TrustRAM Offset */
#define TRAM_RAM450_REG_OFST           _UINT32_(0x1708)    /* (TRAM_RAM450) TrustRAM Offset */
#define TRAM_RAM451_REG_OFST           _UINT32_(0x170C)    /* (TRAM_RAM451) TrustRAM Offset */
#define TRAM_RAM452_REG_OFST           _UINT32_(0x1710)    /* (TRAM_RAM452) TrustRAM Offset */
#define TRAM_RAM453_REG_OFST           _UINT32_(0x1714)    /* (TRAM_RAM453) TrustRAM Offset */
#define TRAM_RAM454_REG_OFST           _UINT32_(0x1718)    /* (TRAM_RAM454) TrustRAM Offset */
#define TRAM_RAM455_REG_OFST           _UINT32_(0x171C)    /* (TRAM_RAM455) TrustRAM Offset */
#define TRAM_RAM456_REG_OFST           _UINT32_(0x1720)    /* (TRAM_RAM456) TrustRAM Offset */
#define TRAM_RAM457_REG_OFST           _UINT32_(0x1724)    /* (TRAM_RAM457) TrustRAM Offset */
#define TRAM_RAM458_REG_OFST           _UINT32_(0x1728)    /* (TRAM_RAM458) TrustRAM Offset */
#define TRAM_RAM459_REG_OFST           _UINT32_(0x172C)    /* (TRAM_RAM459) TrustRAM Offset */
#define TRAM_RAM460_REG_OFST           _UINT32_(0x1730)    /* (TRAM_RAM460) TrustRAM Offset */
#define TRAM_RAM461_REG_OFST           _UINT32_(0x1734)    /* (TRAM_RAM461) TrustRAM Offset */
#define TRAM_RAM462_REG_OFST           _UINT32_(0x1738)    /* (TRAM_RAM462) TrustRAM Offset */
#define TRAM_RAM463_REG_OFST           _UINT32_(0x173C)    /* (TRAM_RAM463) TrustRAM Offset */
#define TRAM_RAM464_REG_OFST           _UINT32_(0x1740)    /* (TRAM_RAM464) TrustRAM Offset */
#define TRAM_RAM465_REG_OFST           _UINT32_(0x1744)    /* (TRAM_RAM465) TrustRAM Offset */
#define TRAM_RAM466_REG_OFST           _UINT32_(0x1748)    /* (TRAM_RAM466) TrustRAM Offset */
#define TRAM_RAM467_REG_OFST           _UINT32_(0x174C)    /* (TRAM_RAM467) TrustRAM Offset */
#define TRAM_RAM468_REG_OFST           _UINT32_(0x1750)    /* (TRAM_RAM468) TrustRAM Offset */
#define TRAM_RAM469_REG_OFST           _UINT32_(0x1754)    /* (TRAM_RAM469) TrustRAM Offset */
#define TRAM_RAM470_REG_OFST           _UINT32_(0x1758)    /* (TRAM_RAM470) TrustRAM Offset */
#define TRAM_RAM471_REG_OFST           _UINT32_(0x175C)    /* (TRAM_RAM471) TrustRAM Offset */
#define TRAM_RAM472_REG_OFST           _UINT32_(0x1760)    /* (TRAM_RAM472) TrustRAM Offset */
#define TRAM_RAM473_REG_OFST           _UINT32_(0x1764)    /* (TRAM_RAM473) TrustRAM Offset */
#define TRAM_RAM474_REG_OFST           _UINT32_(0x1768)    /* (TRAM_RAM474) TrustRAM Offset */
#define TRAM_RAM475_REG_OFST           _UINT32_(0x176C)    /* (TRAM_RAM475) TrustRAM Offset */
#define TRAM_RAM476_REG_OFST           _UINT32_(0x1770)    /* (TRAM_RAM476) TrustRAM Offset */
#define TRAM_RAM477_REG_OFST           _UINT32_(0x1774)    /* (TRAM_RAM477) TrustRAM Offset */
#define TRAM_RAM478_REG_OFST           _UINT32_(0x1778)    /* (TRAM_RAM478) TrustRAM Offset */
#define TRAM_RAM479_REG_OFST           _UINT32_(0x177C)    /* (TRAM_RAM479) TrustRAM Offset */
#define TRAM_RAM480_REG_OFST           _UINT32_(0x1780)    /* (TRAM_RAM480) TrustRAM Offset */
#define TRAM_RAM481_REG_OFST           _UINT32_(0x1784)    /* (TRAM_RAM481) TrustRAM Offset */
#define TRAM_RAM482_REG_OFST           _UINT32_(0x1788)    /* (TRAM_RAM482) TrustRAM Offset */
#define TRAM_RAM483_REG_OFST           _UINT32_(0x178C)    /* (TRAM_RAM483) TrustRAM Offset */
#define TRAM_RAM484_REG_OFST           _UINT32_(0x1790)    /* (TRAM_RAM484) TrustRAM Offset */
#define TRAM_RAM485_REG_OFST           _UINT32_(0x1794)    /* (TRAM_RAM485) TrustRAM Offset */
#define TRAM_RAM486_REG_OFST           _UINT32_(0x1798)    /* (TRAM_RAM486) TrustRAM Offset */
#define TRAM_RAM487_REG_OFST           _UINT32_(0x179C)    /* (TRAM_RAM487) TrustRAM Offset */
#define TRAM_RAM488_REG_OFST           _UINT32_(0x17A0)    /* (TRAM_RAM488) TrustRAM Offset */
#define TRAM_RAM489_REG_OFST           _UINT32_(0x17A4)    /* (TRAM_RAM489) TrustRAM Offset */
#define TRAM_RAM490_REG_OFST           _UINT32_(0x17A8)    /* (TRAM_RAM490) TrustRAM Offset */
#define TRAM_RAM491_REG_OFST           _UINT32_(0x17AC)    /* (TRAM_RAM491) TrustRAM Offset */
#define TRAM_RAM492_REG_OFST           _UINT32_(0x17B0)    /* (TRAM_RAM492) TrustRAM Offset */
#define TRAM_RAM493_REG_OFST           _UINT32_(0x17B4)    /* (TRAM_RAM493) TrustRAM Offset */
